<!-- placeholder-1 -->
```fish
tofu plan -chdir=adventures/02-building-cloudhaven/expert
```
<!-- placeholder-2 -->

<details open><summary>Diff of 1 change.</summary>

```diff
# module.north_market.google_storage_bucket.vault has been deleted
+ module.north_market.google_storage_bucket.vault will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @justinrand at 2026-02-01T19:45:35Z [(view log)](https://github.com/justinrand/open-ecosystem-challenges/actions/runs/21569089269/job/62145199354#step::1).
</summary>

```hcl

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.north_market.google_storage_bucket.vault has been deleted
  - resource "google_storage_bucket" "vault" {
        id                          = "cloudhaven-north-market-vault"
      - location                    = "EU" -> null
      - name                        = "cloudhaven-north-market-vault" -> null
      - url                         = "gs://cloudhaven-north-market-vault" -> null
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.north_market.google_storage_bucket.vault will be created
  + resource "google_storage_bucket" "vault" {
      + effective_labels            = {
          + "district"                   = "north-market"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "district"   = "north-market"
          + "managed-by" = "opentofu"
          + "purpose"    = "merchant-storage"
        }
      + location                    = "EU"
      + name                        = "cloudhaven-north-market-vault"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "district"                   = "north-market"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "opentofu"
          + "purpose"                    = "merchant-storage"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "NEARLINE"
              + type          = "SetStorageClass"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 90
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 3
              + with_state            = "ARCHIVED"
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ districts = {
      ~ north-market      = {
          ~ vault  = {
                name     = "cloudhaven-north-market-vault"
              ~ url      = "gs://cloudhaven-north-market-vault" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged attributes hidden)
    }
```
</details>
<!-- placeholder-5 -->
<!-- tofu-1-b3a7e2e0b478e879fcca30a927c1afe0.tfplan -->
<!-- placeholder-6 -->